smitha1672/project/stm32_code_base/stm32f091/Utilities/STM32F0xx_board/SB50514_C0/STM32F0xx_SB50514_board.c
#include "BSP.h"
#include "stm32f0xx_conf.h"
#include "STM32F0xx_board.h"
#include "stm32f0xx.h"
#include "STM32F0xx_board.h"


#define configINTERNAL_RTC 0
#define configSPI_1 1
#define configSPI_2 1

#define APPLICATION_ADDRESS     (uint32_t)0x08003000
#if   (defined ( __CC_ARM ))
  __IO uint32_t VectorTable[48] __attribute__((at(0x20000000)));
#elif (defined (__ICCARM__))
#pragma location = 0x20000000
  __no_init __IO uint32_t VectorTable[48];
#elif defined   (  __GNUC__  )
  __IO uint32_t VectorTable[48] __attribute__((section(".RAMVectorTable")));
#elif defined ( __TASKING__ )
  __IO uint32_t VectorTable[48] __at(0x20000000);
#endif


static bool bIsSPI1_enable = FALSE;
static bool bIsSPI2_enable = FALSE;

#if defined ( FREE_RTOS )
static xSemaphoreHandle _SPI_SEMA = NULL;
#endif 


/* GPIO */
const GPIO_PhysicalPin PhysicalPins[__IO_MAX] = 
{
    {GPIOB, GPIO_Pin_2, eOUT_PIN},  //PB2    __O_EN_1V,
    {GPIOB, GPIO_Pin_8, eOUT_PIN},  //PB8    __O_RST_DSP,
    {GPIOB, GPIO_Pin_0, eIN_PIN},   //PB0    __I_SCP1_IRQ,  
    {GPIOA, GPIO_Pin_4, eOUT_PIN},  //PA4    __O_SPI1_DSP_CS,
    {GPIOA, GPIO_Pin_1, eOUT_PIN},  //PA1    __O_FLASH_CS,  
    {GPIOA, GPIO_Pin_5, eOUT_PIN},  //PA5    __O_SPI1_SCK, 
    {GPIOB, GPIO_Pin_1, eIN_PIN},   //PB1    __I_SCP1_BUSY,     
    {GPIOB, GPIO_Pin_12,eOUT_PIN},  //PB12   __O_SCP2_FLASH_CS, 
    {GPIOA, GPIO_Pin_11,eOUT_PIN},  //PA11   __O_MCU_SLAVE_MODE,
    {GPIOA, GPIO_Pin_12,eOUT_PIN},  //PA12   __O_MCU_MASTER_MODE,
};


const GPIO_PhysicalPin SPI1Pins[__SPI_IO_MAX] = 
{
    {GPIOB, GPIO_Pin_8, eIN_PIN},       /*PB8 __O_DSP_RES,  */     
    {GPIOA, GPIO_Pin_4, eIN_PIN},       /*PA4 __O_SPI1_DSP_CS, */    
    {GPIOA, GPIO_Pin_5, eIN_PIN},       /*PA5 __O_SPI1_SCK, */    
    {GPIOA, GPIO_Pin_6, eIN_PIN},       /*PA6 __O_SPI1_MISO,*/
    {GPIOA, GPIO_Pin_7, eIN_PIN},       /*PA7 __O_SPI1_MOSI,*/
};

const GPIO_PhysicalPin SPI2Pins[__SPI_IO_MAX] = 
{    
    {GPIOB, GPIO_Pin_12, eIN_PIN},       /*PB12 __O_SCP2_FLASH_CS, */         
    {GPIOB, GPIO_Pin_13, eIN_PIN},       /*PB13 __O_SPI2_SCK, */    
    {GPIOB, GPIO_Pin_14, eIN_PIN},       /*PB14 __O_SPI2_MISO,*/
    {GPIOB, GPIO_Pin_15, eIN_PIN},       /*PB15 __O_SPI2_MOSI,*/
};


static void GPIO_Initialization( void );


static void GPIO_Set( VirtualPin pin );


static void GPIO_Clr( VirtualPin pin );


static uint8_t GPIO_Read_InBit( VirtualPin pin );


static void STM32f0xx_board( void );


static void SPI1_LowLevel_initialize( void );


static void SPI1_LowLevel_release_SPI(void);


static bool SPI1_LowLevel_isEnable( void );


static bool SPI1_write( const byte data );


static bool SPI1_read( byte *data );


static int16 SPI1_writeBuffer(const byte *data, uint16 length, bool LittelEndian);


static int16 SPI1_readBuffer( byte *data, uint16 length, bool LittelEndian );


static uint8_t SPI1_LowLevel_ReadDummy( void );


static void SPI2_LowLevel_initialize( void );


static void SPI2_LowLevel_release_SPI (void );


static bool SPI2_write( byte data );


static bool SPI2_read( byte * data );


static int16 SPI2_writeBuffer(byte *data, uint16 length, bool LittelEndian);


static int16 SPI2_readBuffer(byte *data, uint16 length, bool LittelEndian);


static bool SPI_selectChip( void );


static bool SPI_unselectChip( void );


static bool SPI1_mutex_lock( void );


static bool SPI1_mutex_unlock( void );



const BSP_GPIO_OBJECT bsp_gpio_obj = 
{
    GPIO_Initialization,
    GPIO_Set,
    GPIO_Clr,
    GPIO_Read_InBit,
};
const BSP_GPIO_OBJECT *pBSP_GPIO_OBJECT = &bsp_gpio_obj;

const BSP_SPI_OBJECT bsp_spi_obj = 
{
    SPI1_LowLevel_initialize,
    SPI1_LowLevel_release_SPI,
    SPI1_LowLevel_isEnable,
    SPI1_write,
    SPI1_read,
    SPI1_LowLevel_ReadDummy,
    SPI1_writeBuffer,
    SPI1_readBuffer,
    SPI1_mutex_lock,
    SPI1_mutex_unlock,
    SPI2_LowLevel_initialize,
    SPI2_LowLevel_release_SPI,
    SPI2_write,
    SPI2_read,
    SPI2_writeBuffer,
    SPI2_readBuffer,
    SPI_selectChip,
    SPI_unselectChip,
};
const BSP_SPI_OBJECT *pBSP_SPI_OBJECT = &bsp_spi_obj;

const BSP_BOARD_OBJECT bsp_board_obj = 
{
    STM32f0xx_board
};
const BSP_BOARD_OBJECT *pBSP_BOARD_ObjCtrl = &bsp_board_obj;



//_____________________________________________________________________________
static void RTC_backup__Initialization(void)
{
#if ( configINTERNAL_RTC == 1 )
    /* Enable PWR and BKP clocks */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR , ENABLE); 

    /* Enable write access to Backup domain */
    PWR_BackupAccessCmd(ENABLE);
#endif

}
/*******************************************************************************
 * GPIO
 ******************************************************************************/
static void GPIO_Set( VirtualPin pin )
{
    PhysicalPins[pin].PORTx->BSRR= PhysicalPins[pin].PINx;
};

static void GPIO_Clr( VirtualPin pin )
{
    PhysicalPins[pin].PORTx->BRR = PhysicalPins[pin].PINx;
}

static uint8_t GPIO_Read_InBit( VirtualPin pin )
{
    uint8_t bitstatus = 0x00;

    if( (PhysicalPins[pin].PORTx->IDR & PhysicalPins[pin].PINx) != (uint32_t)Bit_RESET )
    {
        bitstatus = (uint8_t)Bit_SET;
    }
    else
    {
        bitstatus = (uint8_t)Bit_RESET;
    }

    return bitstatus;
}

static void GPIO_Initialization( void )
{
    GPIO_InitTypeDef GPIO_InitStructure;
    RCC_AHBPeriphClockCmd( (RCC_AHBPeriph_GPIOA | RCC_AHBPeriph_GPIOB | 
                            RCC_AHBPeriph_GPIOC | RCC_AHBPeriph_GPIOD | 
                            RCC_AHBPeriph_GPIOF), ENABLE);

    for(uint8_t i=0; i < __IO_MAX; i++ )
    {
        switch( PhysicalPins[i].IO )
        {
            case eOUT_PIN:
                GPIO_InitStructure.GPIO_Pin = PhysicalPins[i].PINx;
                GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT; 
                GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
                GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
                GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;                
                GPIO_Init(PhysicalPins[i].PORTx, &GPIO_InitStructure);
                break;

            case eIN_PIN:
                GPIO_InitStructure.GPIO_Pin = PhysicalPins[i].PINx;
                GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
                GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
                GPIO_Init(PhysicalPins[i].PORTx, &GPIO_InitStructure);
                break;

            case eOD_PIN:
                GPIO_InitStructure.GPIO_Pin = PhysicalPins[i].PINx;
                GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT; 
                GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
                GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
                GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;                
                GPIO_Init(PhysicalPins[i].PORTx, &GPIO_InitStructure);
                break;

            default:
                GPIO_InitStructure.GPIO_Pin = PhysicalPins[i].PINx;
                GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
                GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
                GPIO_Init(PhysicalPins[i].PORTx, &GPIO_InitStructure);
                break;
        }
    }
}


static void SPI1_GPIOLowLevel_DeConfiguration( void )
{
#if ( configSPI_1 == 1 )
    GPIO_InitTypeDef GPIO_InitStructure;

    for(uint8_t i=0; i < __SPI_IO_MAX; i++ )
    {
        GPIO_InitStructure.GPIO_Pin |= SPI1Pins[i].PINx;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_Init(SPI1Pins[i].PORTx, &GPIO_InitStructure);
    }
    
    RCC_AHBPeriphClockCmd( (RCC_AHBPeriph_GPIOA| RCC_AHBPeriph_GPIOB| 
                            RCC_AHBPeriph_GPIOC| RCC_AHBPeriph_GPIOD), 
                            ENABLE);
#endif    

