smitha1672/project/stm32_code_base/stm32f091/Utilities/STM32F0xx_board/SB50514_C0/STM32F0xx_SB50514_board.c
/*******************************************************************************
 *  SPI
 ******************************************************************************/
/* SPI Initialization *********************************************************/
#define _SPI1_CS0_LOW()              GPIO_Clr( __O_SPI1_DSP_CS )
#define _SPI1_CS0_HIGH()             GPIO_Set( __O_SPI1_DSP_CS )

#if defined ( FREE_RTOS )
static bool _SPI_MUTEX_TAKE( void )
{
#if 1
	if ( _SPI_SEMA == NULL )
		return FALSE;

	if ( xSemaphoreTake( _SPI_SEMA, portMAX_DELAY) != pdTRUE )
	{
	    TRACE_DEBUG((0, "DDDDD_SPI TAKE BUSY !! "));
		return FALSE;
	}

        //TRACE_DEBUG((0, "DDDDD_SPI TAKE OK !! "));
        //i_counter++;
	return TRUE;	
#else
        return TRUE;    
#endif
}
#endif 

#if defined ( FREE_RTOS )
static bool _SPI_MUTEX_GIVE( void )
{
#if 1
	if ( _SPI_SEMA == NULL )
		return FALSE;

	if ( xSemaphoreGive( _SPI_SEMA ) != pdTRUE )
	{
	    TRACE_DEBUG((0, "DDDDD_SPI GIVE BUSY !! "));
		return FALSE;	
	}

        //TRACE_DEBUG((0, "DDDDD_SPI GIVE OK !! "));
        //i_counter--;
	return TRUE;
#endif    
}
#endif 

#if defined ( FREE_RTOS )
static bool _SPI_MUTEX_CREATE( void )
{
    if ( _SPI_SEMA == NULL )
    {
        _SPI_SEMA = xSemaphoreCreateMutex();
    }

    if (_SPI_SEMA == NULL)
    {
        TRACE_DEBUG((0, "semaphore create fail !"));
        return FALSE;
    }    

    return TRUE;
}
#endif 


#if defined ( FREE_RTOS )
static void _SPI_MUTEX_RELEASE( void )
{
    if ( _SPI_SEMA )
    {
        vSemaphoreDelete(_SPI_SEMA);
        _SPI_SEMA = NULL;
    }
}
#endif 


#if defined ( FREE_RTOS )
static bool SPI1_mutex_lock( void )
{
    bool ret_val = FALSE;
    
    //TRACE_ERROR((0, "SPI enter --------------- "));
    if ( _SPI_MUTEX_TAKE() == TRUE)
    {
        ret_val = TRUE;
        return ret_val;
    }

    return ret_val;
}
#endif 

#if defined ( FREE_RTOS )
static bool SPI1_mutex_unlock( void )
{
    bool ret_val = FALSE;

    //TRACE_ERROR((0, "SPI_unselectChip loop --------------- "));
    if ( _SPI_MUTEX_GIVE() == TRUE)
    {
        ret_val = TRUE;
    }
    else
    {
        ret_val = FALSE;
    }

    //TRACE_ERROR((0, "SPI outer --------------- %d",i_counter));
    return ret_val;
}
#endif 


static void SPI1_LowLevel_initialize( void )
{
    SPI_InitTypeDef  SPI_InitStructure;
    GPIO_InitTypeDef GPIO_InitStructure;

    _SPI1_CS0_HIGH();

    /*!< Setup SPI Periph clock enable */
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);

    /*!< Configure _SPI pins: SCK */

    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;    
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;    

    GPIO_InitStructure.GPIO_Pin = _SPI_SCK_PIN | _SPI_MISO_PIN | _SPI_MOSI_PIN;    
    GPIO_Init(_SPI_SCK_GPIO_PORT, &GPIO_InitStructure);

    GPIO_PinAFConfig(_SPI_SCK_GPIO_PORT, _SPI_SCK_SOURCE, GPIO_AF_0);
    GPIO_PinAFConfig(_SPI_MISO_GPIO_PORT, _SPI_MISO_SOURCE, GPIO_AF_0);
    GPIO_PinAFConfig(_SPI_MOSI_GPIO_PORT, _SPI_MOSI_SOURCE, GPIO_AF_0);    

    /*!< Deselect the SPI: Chip Select high */

    /*!< _SPI Periph clock enable */
    RCC_APB2PeriphClockCmd(_SPI_CLK, ENABLE);

    /*!< SPI configuration */
    SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    
    /*
        SPI_BaudRatePrescaler_8: SPI SCK is nearly 9Mhz
        SPI_BaudRatePrescaler_4: SPI SCK is nearly 18Mhz
    */

    SPI_InitStructure.SPI_BaudRatePrescaler = 8;//SPI_BaudRatePrescaler_4;
    SPI_InitStructure.SPI_CRCPolynomial = 7;

    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;

    SPI_Init(_SPI, &SPI_InitStructure);
    SPI_RxFIFOThresholdConfig(_SPI, SPI_RxFIFOThreshold_QF);

    /*!< Enable the SPI  */
    SPI_Cmd(_SPI, ENABLE);
    bIsSPI1_enable = TRUE;

    _SPI_MUTEX_CREATE( );
}


static void SPI1_LowLevel_Deinitialize( void )
{
    GPIO_InitTypeDef GPIO_InitStructure;

    /*!< Disable the _SPI  */
    SPI_Cmd(_SPI, DISABLE);
    
    GPIO_InitStructure.GPIO_Pin = _SPI_SCK_PIN | _SPI_MISO_PIN | _SPI_MOSI_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT; 
    GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;    
    GPIO_Init(_SPI_SCK_GPIO_PORT, &GPIO_InitStructure);
    bIsSPI1_enable = FALSE;

    _SPI_MUTEX_RELEASE( );
}

static uint8_t SPI1_LowLevel_ReadDummy( void )
{
    uint8_t data = 0;

    data = SPI_ReceiveData8(_SPI);
    return data;
}

static bool SPI1_LowLevel_isEnable( void )
{
    return bIsSPI1_enable;
}

static void SPI1_LowLevel_release_SPI(void)
{
    SPI1_LowLevel_Deinitialize();
    SPI1_GPIOLowLevel_DeConfiguration();
}

static bool SPI1_write( const byte data ) 
{
    bool ret = TRUE;

    if ( bIsSPI1_enable != TRUE )
    {
        TRACE_ERROR((0, "SPI interface has not been enable !!"));
        return FALSE;
    }

    //! Read data for slave address, this MISO byte is unavailable; Smith@{
    /*!< Loop while DR register in not emplty */
    while (SPI_I2S_GetFlagStatus(_SPI, SPI_I2S_FLAG_TXE) == RESET);

    /*!< Send byte through the SPI1 peripheral */
    SPI_SendData8(_SPI, data);

    /*!< Wait to receive a byte */
    while (SPI_I2S_GetFlagStatus(_SPI, SPI_I2S_FLAG_RXNE) == RESET);

    /*rxBuff = */
    SPI_ReceiveData8(_SPI);

    // TRACE_DEBUG((0, "SPI data write = 0x%X", data));

    return ret;
}

static bool SPI1_read( byte *data ) 
{
    bool ret = TRUE;
    byte *ptr;
    uint8_t rxBuff;

    if ( bIsSPI1_enable != TRUE )
    {
        TRACE_ERROR((0, "SPI interface has not been enable !!"));
        return FALSE;
    }
    
    ptr = data;

