smitha1672/project/stm32_code_base/stm32f091/Utilities/STM32F0xx_board/SB50514_C0/STM32F0xx_SB50514_board.c
    /*!< Loop while DR register in not emplty */
    while (SPI_I2S_GetFlagStatus(_SPI, SPI_I2S_FLAG_TXE) == RESET);

    /*!< Send byte through the SPI1 peripheral */
    SPI_SendData8(_SPI, 0xFF);

    /*!< Wait to receive a byte */
    while (SPI_I2S_GetFlagStatus(_SPI, SPI_I2S_FLAG_RXNE) == RESET);

    rxBuff = SPI_ReceiveData8(_SPI);
    
    //TRACE_DEBUG((0, "SPI data read = 0x%X", rxBuff));

    *ptr = rxBuff;

    return ret;
}

static bool SPI_selectChip( void )
{
    _SPI1_CS0_LOW();
    return TRUE;
}

static bool SPI_unselectChip( void )
{
    _SPI1_CS0_HIGH();
    return TRUE;
}

static int16 SPI1_writeBuffer(const byte *data, uint16 length, bool LittelEndian)
{
    int16 ret = SPI_RET_ERROR_LEN;
    const byte *ptr;
    
    if(LittelEndian)
        ptr = data + length - 1;
    else
        ptr = data;
    
    ret = 0;

    while(length > 0)
    {  
        if(SPI1_write(*ptr) == TRUE)
        {
            ret++;
        }
        else
        {    
            //ASSERT_BOOL(TRUE);
            return ret;
        }

        if(LittelEndian)
            ptr--;
        else
            ptr++;
        
        length--;
    }    
    return ret; 
}


static int16 SPI1_readBuffer( byte *data, uint16 length, bool LittelEndian )
{
    int16 ret = SPI_RET_ERROR_LEN;
    byte rxBuff;
    byte *ptr;

    if(LittelEndian)
        ptr = data + length - 1;
    else
        ptr = data;
    
    ret = 0;

    while(length > 0)
    {
        if(SPI1_read(&rxBuff) == TRUE)
        {
            *ptr = rxBuff;
            ret++;
        }
        else
        {
            //ASSERT_BOOL(TRUE);
            return ret;
        }
        
        if(LittelEndian)
            ptr--;
        else
            ptr++;
        
        length--;
    }

    return ret;
}


static void SPI2_LowLevel_initialize( void )
{
    SPI_InitTypeDef  SPI_InitStructure;
    GPIO_InitTypeDef GPIO_InitStructure;

    _SPI2_CS0_HIGH();

    /*!< Setup SPI Periph clock enable */
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);

    /*!< Configure _SPI pins: SCK */

    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;    
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;    

    GPIO_InitStructure.GPIO_Pin = _SPI2_SCK_PIN | _SPI2_MISO_PIN | _SPI2_MOSI_PIN;    
    GPIO_Init(_SPI2_SCK_GPIO_PORT, &GPIO_InitStructure);

    GPIO_PinAFConfig(_SPI2_SCK_GPIO_PORT, _SPI2_SCK_SOURCE, GPIO_AF_0);
    GPIO_PinAFConfig(_SPI2_MISO_GPIO_PORT, _SPI2_MISO_SOURCE, GPIO_AF_0);
    GPIO_PinAFConfig(_SPI2_MOSI_GPIO_PORT, _SPI2_MOSI_SOURCE, GPIO_AF_0);    

    /*!< Deselect the SPI: Chip Select high */

    /*!< _SPI Periph clock enable */
    RCC_APB1PeriphClockCmd(_SPI2_CLK, ENABLE);

    /*!< SPI configuration */
    SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    
    /*
        SPI_BaudRatePrescaler_8: SPI SCK is nearly 9Mhz
        SPI_BaudRatePrescaler_4: SPI SCK is nearly 18Mhz
    */

    SPI_InitStructure.SPI_BaudRatePrescaler = 8;//SPI_BaudRatePrescaler_4;
    SPI_InitStructure.SPI_CRCPolynomial = 7;

    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;

    SPI_Init(_SPI2, &SPI_InitStructure);
    SPI_RxFIFOThresholdConfig(_SPI2, SPI_RxFIFOThreshold_QF);

    /*!< Enable the SPI  */
    SPI_Cmd(_SPI2, ENABLE);
    bIsSPI2_enable = TRUE;
}


static void SPI2_LowLevel_Deinitialize( void )
{
    GPIO_InitTypeDef GPIO_InitStructure;

    /*!< Disable the _SPI  */
    SPI_Cmd(_SPI2, DISABLE);
    
    GPIO_InitStructure.GPIO_Pin = _SPI2_SCK_PIN | _SPI2_MISO_PIN | _SPI2_MOSI_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT; 
    GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;    
    GPIO_Init(_SPI2_SCK_GPIO_PORT, &GPIO_InitStructure);
    bIsSPI2_enable = FALSE;
}


static bool SPI2_LowLevel_isEnable( void )
{
    return bIsSPI2_enable;
}


static void SPI2_LowLevel_release_SPI(void)
{
    SPI2_LowLevel_Deinitialize();
    SPI2_GPIOLowLevel_DeConfiguration();
}


static bool SPI2_write( byte data ) 
{
    bool ret = TRUE;

    if ( bIsSPI2_enable != TRUE )
    {
        TRACE_ERROR((0, "SPI interface has not been enable !!"));
        return FALSE;
    }

    //! Read data for slave address, this MISO byte is unavailable; Smith@{
    /*!< Loop while DR register in not emplty */
    while (SPI_I2S_GetFlagStatus(_SPI2, SPI_I2S_FLAG_TXE) == RESET);

    /*!< Send byte through the SPI1 peripheral */
    SPI_SendData8(_SPI2, data);

    /*!< Wait to receive a byte */
    while (SPI_I2S_GetFlagStatus(_SPI2, SPI_I2S_FLAG_RXNE) == RESET);

    /*rxBuff = */
    SPI_ReceiveData8(_SPI2);

    // TRACE_DEBUG((0, "SPI data write = 0x%X", data));

    return ret;
}


static bool SPI2_read( byte *data ) 
{
    bool ret = TRUE;
    byte *ptr;
    uint8_t rxBuff;

    if ( bIsSPI2_enable != TRUE )
    {
        TRACE_ERROR((0, "SPI interface has not been enable !!"));
        return FALSE;
    }
    
    ptr = data;

    /*!< Loop while DR register in not emplty */
    while (SPI_I2S_GetFlagStatus(_SPI2, SPI_I2S_FLAG_TXE) == RESET);

    /*!< Send byte through the SPI1 peripheral */
    SPI_SendData8(_SPI2, 0xFF);

    /*!< Wait to receive a byte */
    while (SPI_I2S_GetFlagStatus(_SPI2, SPI_I2S_FLAG_RXNE) == RESET);

    rxBuff = SPI_ReceiveData8(_SPI2);
    
    //TRACE_DEBUG((0, "SPI data read = 0x%X", rxBuff));

    *ptr = rxBuff;

    return ret;
}


