smitha1672/project/stm32_code_base/stm32f091/Utilities/STM32F0xx_board/SB50514_C0/STM32F0xx_SB50514_board.c
static bool SPI2_selectChip( unsigned char chip )
{
    if ( chip == 0)
    {
        _SPI2_CS0_LOW();
    }
    
    return TRUE;
}


static bool SPI2_unselectChip( unsigned char chip )
{
    if ( chip == 0)
    {
        _SPI2_CS0_HIGH();
    }

    return TRUE;
}

static int16 SPI2_writeBuffer(byte *data, uint16 length, bool LittelEndian)
{
    int16 ret = SPI_RET_ERROR_LEN;
    byte *ptr;
    
    if(LittelEndian)
        ptr = data + length - 1;
    else
        ptr = data;
    
    ret = 0;

    while(length > 0)
    {  
        if(SPI2_write(*ptr) == TRUE)
        {
            ret++;
        }
        else
        {    
            return ret;
        }

        if(LittelEndian)
            ptr--;
        else
            ptr++;
        
        length--;
    }    
    return ret; 
}


static int16 SPI2_readBuffer(byte *data, uint16 length, bool LittelEndian)
{
    int16 ret = SPI_RET_ERROR_LEN;
    byte rxBuff;
    byte *ptr;

    if(LittelEndian)
        ptr = data + length - 1;
    else
        ptr = data;
    
    ret = 0;

    while(length > 0)
    {
        if(SPI2_read(&rxBuff) == TRUE)
        {
            *ptr = rxBuff;
            ret++;
        }
        else
        {
            //ASSERT_BOOL(TRUE);
            return ret;
        }
        
        if(LittelEndian)
            ptr--;
        else
            ptr++;
        
        length--;
    }

    return ret;
}


/*******************************************************************************
 *  SPI common
 ******************************************************************************/
void SPI_CirrusTool_mode(void)
{
    TRACE_DEBUG((0, "DSP SPI release  !!"));
    GPIO_Initialization();       
    SPI_LowLevel_release_SPI();
    SPI2_LowLevel_release_SPI();
    GPIO_Clr(__O_MCU_MASTER_MODE);
    GPIO_Set(__O_MCU_SLAVE_MODE); /* Set slave mode */
    GPIO_Clr(__O_RST_DSP);    
    //VirtualTimer_sleep_100us(1); /* require 1us */
    GPIO_Set(__O_RST_DSP); 

}

void SPI_FlashUpdate_mode(void)
{
    TRACE_DEBUG((0, "DSP Flash update mode  !!"));
    GPIO_Initialization();       
    SPI1_LowLevel_release_SPI();
    SPI2_LowLevel_initialize();
    GPIO_Clr(__O_MCU_MASTER_MODE);
    GPIO_Set(__O_MCU_SLAVE_MODE); /* Set slave mode */
    GPIO_Clr(__O_RST_DSP);    

}

static void SPI_MasterBoot_mode(void)
{
    TRACE_DEBUG((0, "DSP Master boot  !!"));
    GPIO_Initialization();
    SPI1_LowLevel_initialize();
    SPI2_LowLevel_release_SPI();
    GPIO_Set(__O_MCU_MASTER_MODE); /* Set master mode */
    GPIO_Clr(__O_MCU_SLAVE_MODE);  
    GPIO_Set(__O_EN_1V);       
    GPIO_Clr(__O_RST_DSP);
    //VirtualTimer_sleep_100us(1); /* require 1us */
    GPIO_Set(__O_RST_DSP); 
}

static void SetVectorTable(  void )
{
    uint32_t i = 0;  
    /* Relocate by software the vector table to the internal SRAM at 0x20000000 ***/  

    /* Copy the vector table from the Flash (mapped at the base of the application
    load address 0x08003000) to the base address of the SRAM at 0x20000000. */
    for(i = 0; i < 48; i++)
    {
        VectorTable[i] = *(__IO uint32_t*)(APPLICATION_ADDRESS + (i<<2));
    }

    /* Enable the SYSCFG peripheral clock*/
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_SYSCFG, ENABLE); 
    /* Remap SRAM at 0x00000000 */
    SYSCFG_MemoryRemapConfig(SYSCFG_MemoryRemap_SRAM);
}


static void STM32f0xx_board(void)
{
    SetVectorTable( );
    GPIO_Initialization();
    Uart1_Initialization();
    Uart2_Initialization();
    SPI1_LowLevel_initialize( );
    SPI2_LowLevel_initialize( );
    Debug_initialize();  
    RTC_backup__Initialization();
}

